RDVMI.rdvmi-ext/src/InformationRegisters/рдв_ОшибкиИнтеграции/рдв_ОшибкиИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_ОшибкиИнтеграции</name>
  <comment>VELO-640</comment>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.рдв_ТипыОшибокИнтеграции</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОшибки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сообщение</name>
    <type>
      <types>CatalogRef.рдв_СообщенияИнтеграции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Интеграция</name>
    <type>
      <types>EnumRef.рдв_вм_Интеграции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОшибкиМс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RDVMI.rdvmi-ext/src/Enums/рдв_ТипыОшибокИнтеграции/рдв_ТипыОшибокИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_ТипыОшибокИнтеграции</name>
  <comment>VELO-640</comment>
  <enumValues>
    <name>ИсключениеОбработкиСервиса</name>
  </enumValues>
  <enumValues>
    <name>ОбщаяОшибка</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/InformationRegisters/рдв_ОшибкиИнтеграции/ManagerModule.bsl
Процедура ЗаписатьОшибкуИнтеграции(ИнформацияОбОшибке, Контекст) Экспорт
	
	ДатаОшибкиМс = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	ДатаЗаписиНачалоЧаса = НачалоЧаса(ТекущаяДатаСеанса);
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторСообщения.Установить(Контекст.ИдентификаторСообщения);
	Набор.Отбор.ДатаОшибкиМс.Установить(ДатаОшибкиМс);
	Набор.Отбор.ДатаЗаписиНачалоЧаса.Установить(ДатаЗаписиНачалоЧаса);
	
	Запись = Набор.Добавить();
	Запись.ИдентификаторСообщения = Контекст.ИдентификаторСообщения;
	Запись.ДатаОшибкиМс = ДатаОшибкиМс;
	Запись.ДатаЗаписиНачалоЧаса = ДатаЗаписиНачалоЧаса;
	Запись.ТипОшибки = ?(ЗначениеЗаполнено(Контекст.ТипОшибки)
											, Контекст.ТипОшибки
											, Перечисления.рдв_ТипыОшибокИнтеграции.ОбщаяОшибка);
	Запись.ДатаОшибки = ТекущаяДатаСеанса;
	
	Если ТипЗнч(ИнформацияОбОшибке) = Тип("Строка") Тогда
		ПредставлениеОшибки = ИнформацияОбОшибке;
	Иначе
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецЕсли;
	
	Запись.ОписаниеОшибки = СтрШаблон("Ошибка события:%1%2%3", Контекст.Событие, Символы.ПС
													, ПредставлениеОшибки);
	
	Набор.Записать();
	
КонецПроцедуры
